# Створіть магазин канцтоварів використовуючи списки для зберігання елементів.
# Для додавання елементів створіть функцію, яка буде запитувати дані
# в користувача і зібрані дані у вигляді кортежу додавати у
# створений список на початку. Результат вивести на екран.
# Під час створення дотримуйтесь правил специфікації PEP 8.


items_list = ['pen', 'A4', 'red strip']


def add_new_item():
    new_item = input('Add new items split by comma :',)
    items_list.insert(0, tuple(new_item.split(sep=',')))


add_new_item()
print(items_list)
