# Створіть функцію quadratic_equation, яка приймає на вхід 3 параметри: a, b, c. Усередині цієї функції створити
# змінні x1, x2 зі значенням None (спочатку приймаємо, що рівняння не має коренів) та функцію calc_rezult з формальними
# параметрами зовнішньої функції quadratic_equation. Всередині функції calc_rezult здійснити пошук дискримінанта,
# згідно з результатом якого зробити розрахунок коренів рівняння. Зовнішня функція quadratic_equation має повернути
# перелік значень коренів квадратного рівняння. Надати можливість користувачеві ввести з клавіатури формальні
# параметри для передачі їх у створену функцію quadratic_equation, результати роботи функції відобразити на екрані.

def quadratic_equation(a, b, c):
    x_1 = None
    x_2 = None

    def calc_result(x_1, x_2):
        dis = b ** 2 - (4 * a * c)

        if dis > 0:
            x_1 = (-b) + (dis ** 0.5) / (2 * a)
            x_2 = (-b) - (dis ** 0.5) / (2 * a)
            return x_1, x_2
        elif dis == 0:
            x_1 = (-b) / (2 * a)
            return x_1
        else:
            return

    return calc_result(x_1, x_2)


print(quadratic_equation(1, 9, 16))
